[server]
port		=	6000	;本地端口
golden_code =	292		;本地金色代码
open_mapping	=	0		; 是否使用映射的外网ip和端口
mapping_ip	=	127.0.0.1	; 外网网关ip
mapping_port	= 8020		; 映射端口

[world]
id			=	30001	;游戏世界ID
name		=	小三世界;游戏世界名称
section_id	=	90001	;大区ID
section_name =	Loong_yg ;大区名称
player_num_limit = 3000	;人数上限
save_num_per_tick = 1	;定时保存
role_level_limit = 100			;人物等级上限
pk_runaway_ticks = 300		;pk逃逸后，延迟下线时间
login_timeout_ticks = 50	;登陆超时时间(tick数)
sale_distance = 8		;摆摊距离

[db_server]
ip = 172.17.3.13			;dbserver的ip
port = 5005				;dbserver的port
golden_code = 90100891			;dbserver的金色代码

[login_server]
ip = 172.17.3.13			;loginserver的ip
port = 5050				;loginserver的port
golden_code = 300			;loginserver的金色代码

[gm_server]
ip = 172.17.3.13			;gmserver的ip
port = 6600				;gmserver的端口

[bill_server]
ip = 172.17.3.13			;billserver的ip
port = 7123				;billserver的端口

[CA_info]
area		=	CN 
black_list	=	F:\CASolution\debug\Files\black.dat
certificate	=	F:\CASolution\debug\Files\10015Certificate.dat

[CA_svrlist]
num			=	1
ca_1		=	172.17.3.16
port_1		=	7000

[window]
width = 800				;窗口大小
height = 600				;窗口大小

[cheat]
lax_cheat_distance = 50			;外挂距离检测
strict_cheat_distance = 10		;外挂距离检测

[quest]					;任务属性的相关路径
path = data\system\quest
list = data\system\quest\quest.xml
acceptQuest_NPC_relation = data\system\quest\accept_quest_npc.data
completeQuest_NPC_relation = data\system\quest\complete_quest_npc.data

[loot]					;掉落属性的相关路径
creature_loot = data\system\attdata\loot_proto.xml
loot_item_set = data\system\attdata\loot_item_set_proto.xml
loot_quest_item = data\system\attdata\loot_quest_item_proto.xml

[script]				;脚本目录
path = server_data\script

[vip_netbar]				;金牌网吧路径
open	= 1	;	开启1，关闭是0
path = server_data\vip_netbar.xml

[house_keeping]			;清理
max_recv_wait_unit_num	= 64			;客户端等待处理的包的最大数量，超过数量将被踢掉
max_send_cast_unit_num	= 1000			;发送给客户端但还没有收到响应的包数量，超过数量将被踢掉
max_send_cast_size		= 2097152	;发送给客户端但还没有收到相应的字节数量，超过即被踢掉

[chat_log]
on = 0					;开启聊天log
channelflag = 255		;255(全开) 0(全关) 1(私聊) 128(除系统公告外，全关) 129(除系统和私聊外，全关)

[worldinfo]
enableexpresspay		= 1															; 是否显示直冲按钮
expresspayurl			= http://passport.kongzhong.com/billing/pay/pay_long.jsp		; 直冲的url
loginmode			= 1															; 1为大陆，2为迅雷，0为新疆，3为台湾。
today_hot_activity_url	= http://passport.kongzhong.com/billing/pay/pay_long.jsp		; 今日热门活动URL


[spirit]
on = 0			; 精力系统是否开启
level = 40 		; 起效的级别
pointperminute = 1	; 离线恢复速度 点/分钟
reward	= 320		; 领奖点数

count = 4		; 精力对应的加成百分比个数
upper_bound_0 = 360	; 精力对应的加成百分比1
rate_0 = 120
upper_bound_1 = 300	; 精力对应的加成百分比2
rate_1 = 100
upper_bound_2 = 120	; 精力对应的加成百分比3
rate_2 = 75
upper_bound_3 = 60	; 精力对应的加成百分比4
rate_3 = 50

rewardcount = 2		; 领取奖品
reward_0 = 1352002	; 神龙鼎
reward_num_0 = 1	; 数量
reward_quality_0 = -1	; 品级
reward_1 = 1352003	; 龙珠
reward_num_1 = 1	; 数量
reward_quality_1  = -1	; 品级

strengthcount=2	; 实力可兑换物品数量
strength_0 = 6		; 实力值
strength_item_0 = 1000802 ;  道具ID
strength_1 = 12		; 实力值
strength_item_1 = 1000803 ;  道具ID

[pet]
packet_valve	= 10	; 宠物栏位个数
[preventlost]
offline_reward	= 1	; 离线奖励开关1为开；0即为关
loonglessing	= 1	; 神龙赐福开关1为开；0为关
playerback	= 0	; 玩家回归
[title]
title_num       = 247   ; 称号的最大个数

[arena]
on              = 1     ;  0为关闭竞技场，1为开放竞技场

[talent_show]
on              = 1     ;  0为关闭新疆选秀活动，1为开放选秀活动

[fabao]
on		= 1	; 0为关闭法宝相关处理，1为开
level_limit = 59	; 妖精升级最高经验
food_qualif	= 1		; 妖精资质与食物功能
elem_stunt	= 1		; 妖精元素伤害以及特技功能
birth_open	= 1;	; 开启妖精生育

[create_role]
max_role_num    = 5     ;  创建玩家角色个数限制,防外挂

[city_struggle]		; 城战
on		= 0	; 1为开启城战，0为关闭城战
[soaring]
on		= 1	; 飞升开关

[auto_fight]
time_interval	= 1000	; 单位为毫秒

[battle_field]
tshzh_open	= 1	; 天神冢战场（0：关，1：开）
qhzhh_open	= 0	; 七花之海战场（0：关，1：开）
bllg_open	= 0	; 奔雷裂谷战场（0：关，1：开）

[kill_counter]
open		= 0 ; 击杀计数系统开关（0：关，1：开）

[guild_war]
open		= 0; 公会战开关（0：关，1：开）

[fairy_contract]
open		= 1; 妖精契约开关（0：关，1：开）

[keycode_recharge_bridge_server]
on = 0							; key码直充功能开关（0：关   1：开）
ip = 172.17.3.18			; key码直充验证服务器ip
port = 7124					; key码直充验证服务器端口

[god_strengthen]
open		= 1	; 神铸开关
gs_quality 	= 5	; 可以神铸的装备最低品质要求，即紫色(5)以上
gs_cooldown	= 24	; 神铸冷却时间，也即两次神铸升级的最小时间间隔
gs_assist_quality	= 2	; 神铸辅助装备的最低品级
gs_assist_equiplevel	= 70	; 神铸辅助装备的最少等级
[easy_team]
open		= 1	; 便捷组队开关
listen_team	= 0	; 是否监听组队变化，暂时不监听，一定要注意
team_limit	= 500	; 组队个人等数量限制
pck_limit	= 2048	; 每个包最大字节长度

[media_online_num]
record_interval = 10	;统计各个媒体的在线人数的时间间隔，单位为分钟

[duo_bao_qi_bing]
Sunday			= 0	;夺宝奇兵活动周日是否开放（0：关   1：开）
Monday		= 0	;夺宝奇兵活动周一是否开放（0：关   1：开）
Tuesday		= 0	;夺宝奇兵活动周二是否开放（0：关   1：开）
Wednesday	= 1	;夺宝奇兵活动周三是否开放（0：关   1：开）
Thursday		= 0	;夺宝奇兵活动周四是否开放（0：关   1：开）
Friday			= 0	;夺宝奇兵活动周五是否开放（0：关   1：开）
Saturday		= 1	;夺宝奇兵活动周六是否开放（0：关   1：开）

[wgcheck_on]
on                      = 1;  客户端反外挂 0 关，1 开

[facebook_bs]
open	= 1			; 开关，1开；0关
ip		= 127.0.0.1	; facebook边界服务器ip
port	= 6666		; facebook边界服务器端口

[god_bid]
on = 1				;神之竞标系统开关（0：关   1：开）
FixedBidStartTimeCnt = 3;		每周固定竞标开始时间个数
FixedBidStartTime_1 = 12;		
FixedBidStartTime_2 = 19;		
FixedBidStartTime_3 = 22;		
WeekendAddedBidStartTimeCnt = 2;	周末加开的竞标开始时间个数
WeekendAddedBidStartTime_1 = 14;	
WeekendAddedBidStartTime_2 = 16;	
[overseas_version]
shielding_on		= 1	; 屏蔽功能是否开启，1开启；0关闭

[egg_broker]
on = 1					;砸金蛋系统开关

[old_server_new_player]
max_level=59		;属于新玩家的最大等级
year=2011			;老服新玩家特权机制开启年份
month=1				;老服新玩家特权机制开启月份
day=10				;老服新玩家特权机制开启日

[pro_counter]
on	=	1	; // 1开启；0关闭
;local	=	chinese; chinese中文
[pk_constraints]
on	=	1	; 1开启，0关闭
min_level = 	30	; 最小开启等级

deduct_morality = 30	;控制每次杀人，被扣除的道德值
morality_time = 60	;控制在线时，多长时间(秒)回复一次道德值
return_morality = 1	;控制在线时，每次回复的道德值

[wardrobe]          ; 衣橱
on              =  0 ; 衣橱功能开启标志，1开启，0关闭

[GodSystem]
on	=	1	; 神系统开关



[xtrap]				;XTrap防外挂服务器功能
on              =  0 ; XTrap防外挂服务器功能开启标志，1开启，0关闭

[GodSystem]
on = 1

[role_pk_log]
num = 1
roleid1 = 22;roleid1 = 22;

[data_collect]
on = 0;

[IPGSystem]
on = 0

[ipg_server]
ip=172.17.3.22
port_getcash=9991
port_takecash=9992

[PrintRoleInfo]
on		= 1	; 0关闭打印玩家信息，1为开
[holy_soul_equip]	 ;元神装备强化系统	
StarEnhance_On = 1	 ;冲星强化

[InternetCafes]		; 韩国网吧奖励功能
on = 1; 0关闭，1为开
usessl = 1;
verify = 0;
ip = zhangzhihua.trbj.org
port = 9009
;下面选项不能为空
certname = filename ;客户端的证书(需经CA签名)
keyname = filename ;客户端的私钥
cacertname = filename ;CA 的证书
keypassword = filename ;生成用户私钥时使用的密码

[KickPlayerLog]          ; Kick player Log
on              =  1 ; Kick player Log开启标志，1开启，0关闭

[NetCmdLog]                 
on = 0									; 网络协议记录开启标志，1
LogTimeInterval = 600		; 日志时间间隔

[KillRoleLog]          ; Kill role Log
on              =  0 ; Kick role记Log库开启标志，1开启，0关闭